nest-app/artillery.yml
config:
  target: "http://localhost:4000"
  http:
    timeout: 10
  phases:
    - duration: 300
      arrivalRate: 10
      maxVusers: 50
before:
  flow:
    - log: "Log in"
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          - json: $.token
            as: token
scenarios:
  - name: "Test user routes"
    flow:
      - post:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            name: "test_user"
            login: "test_user--{{ $randomString(8) }}"
            password: "test"
          capture:
            json: $.id
            as: user_id
          expect:
            - statusCode: 201
      - get:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/users/{{ user_id }}"
          headers:
            authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - put:
          url: "/users/{{ user_id }}"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            name: "test_user--updated"
            password: "test_user--updated"
          expect:
            - statusCode: 200
      - delete:
          url: "/users/{{ user_id }}"
          headers:
            authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200